index.html
<!doctype html>
<html lang="en">
<head>
<title>Avi Press</title>
<!-- 2022-09-28 Wed 19:22 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<link rel="icon" type="image/png" sizes="32x32" href="./images/dwarf-icon.png">
<link rel="stylesheet" href="./css/styles.css">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-12"><h1 class="title">Avi Press</h1>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">About me</h2>
<div class="outline-text-2" id="text-">
<ul class="org-ul">
<li>Software engineer, functional programming enthusiast, open-source maintainer and advocate
</li>
<li>Founder and CEO of <a href="https://scarf.sh">Scarf</a> - Scarf build advanced download and adoption metrics for open source software
</li>
<li>Former engineer at Pandora
</li>
<li>Based in Oakland, California
</li>
<li>This site is built with <a href="https://orgmode.org/">Org Mode</a>. 
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Contact</h2>
<div class="outline-text-2" id="text-">
<ul class="org-ul">
<li>Follow me on <a href="https://twitter.com/avi_press">Twitter</a>, <a href="https://github.com/aviaviavi">Github</a>
</li>
<li>I hold open office hours for anyone that you can book with me <a href="https://calendly.com/avi-press/office-hours">here</a>, no prior confirmation from me required.
</li>
<li>Email: <a href="mailto:mail@avi.press">mail@avi.press</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Other things</h2>
<div class="outline-text-2" id="text-">
<ul class="org-ul">
<li><a href="https://tabdextension.com">Tabd</a> - a chrome extension for sharing tabs. Give it a try!
</li>
<li><a href="wilson-reunion.html">Wilson High School Class of 2010 Reunion</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Content</h2>
<div class="outline-text-2" id="text-">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="text-left"><a href="https://twit.tv/shows/floss-weekly/episodes/693?autostart=false">FLOSS Weekly Podcast</a></td>
<td class="text-left">August 10, 2022</td>
</tr>

<tr>
<td class="text-left"><a href="https://www.youtube.com/watch?v=Yt_IgHZD4v4">The Secret Sauce: Who's Looking At Your GitHub Project? (YouTube)</a></td>
<td class="text-left">August 3, 2022</td>
</tr>

<tr>
<td class="text-left"><a href="https://percona.podbean.com/e/data-collection-download-metrics-and-scarf-percona-database-podcast-77-w-avi-press/">Percona's HOSS Talks FOSS Podcast</a></td>
<td class="text-left">July 1, 2022</td>
</tr>

<tr>
<td class="text-left"><a href="https://www.forbes.com/sites/forbestechcouncil/2022/06/01/distribution-and-the-economics-of-open-source-software">Distribution and the Economics of Open-Source Software (Forbes)</a></td>
<td class="text-left">June 1, 2022</td>
</tr>

<tr>
<td class="text-left"><a href="https://www.youtube.com/watch?v=aKUJ0_n0KZ0&amp;list=PLmyjALM1NE24x6-vPqfgnMWrymQddJHy6">PyCon 2022 Talk - Beyond the Download Count: Understanding the Usage of your Public Python Packages</a></td>
<td class="text-left">April 29, 2022</td>
</tr>

<tr>
<td class="text-left"><a href="https://anchor.fm/ossstartuppodcast/episodes/E31-Understanding-Your-Open-Source-Usage-with-Scarf-e1honsa">Open Source Startup Podcast: Understanding Your Open Source Usage with Scarf</a></td>
<td class="text-left">April 7, 2022</td>
</tr>

<tr>
<td class="text-left"><a href="https://www.forbes.com/sites/forbestechcouncil/2022/04/06/uniting-to-act-on-untapped-leverage-how-open-source-maintainers-can-work-together-and-prioritize-long-term-sustainability">Uniting To Act On Untapped Leverage: How Open-Source Maintainers Can Work Together And Prioritize Long-Term Sustainability (Forbes)</a></td>
<td class="text-left">April 6, 2022</td>
</tr>

<tr>
<td class="text-left"><a href="https://www.youtube.com/watch?v=ZEo7JZb3Xpo">Cloud Native Containers Meetup - Beyond the Download: Understanding the Usage of Your Public Containers</a></td>
<td class="text-left">March 22, 2022</td>
</tr>

<tr>
<td class="text-left"><a href="https://about.scarf.sh/post/standing-with-ukraine">Scarf Will Block Package Downloads from the Russian Government</a></td>
<td class="text-left">March 2, 2022</td>
</tr>

<tr>
<td class="text-left"><a href="https://podcast.chaoss.community/53">CHAOSSCast:Gathering Open Source Usage Data with Avi Press</a></td>
<td class="text-left">February 25, 2022</td>
</tr>

<tr>
<td class="text-left"><a href="https://www.emilyomier.com/podcast/making-data-transparent-and-accessible-with-avi-press">Cloud Native Startup Podcast: Making Data Transparent and Accessible</a></td>
<td class="text-left">January 26, 2022</td>
</tr>

<tr>
<td class="text-left"><a href="https://serokell.io/blog/how-scarf-uses-haskell">Serokell Blog Interview: Haskell in Production @ Scarf</a></td>
<td class="text-left">November 9, 2021</td>
</tr>

<tr>
<td class="text-left"><a href="https://juniortosenior.io/67">Junior to Senior Podcast</a></td>
<td class="text-left">November 1, 2021</td>
</tr>

<tr>
<td class="text-left"><a href="https://about.scarf.sh/post/direct-downloads-via-scarf-gateway">Measuring Downloads of Anything You Distribute</a></td>
<td class="text-left">September 3, 2021</td>
</tr>

<tr>
<td class="text-left"><a href="https://podcast.curiefense.io/15">Committing to Cloud Native Podcast: Analytics for Open Source Maintainers with Avi Press</a></td>
<td class="text-left">June 28, 2021</td>
</tr>

<tr>
<td class="text-left"><a href="https://console.substack.com/p/console-51?s=r">My interview on the Console Newsletter</a></td>
<td class="text-left">May 2, 2021</td>
</tr>

<tr>
<td class="text-left"><a href="https://podcast.sustainoss.org/70">Sustain OSS Podcast: Avi Press and Scarf</a></td>
<td class="text-left">March 5, 2021</td>
</tr>

<tr>
<td class="text-left"><a href="https://about.scarf.sh/post/announcing-scarf-gateway">Announcing The Scarf Gateway</a></td>
<td class="text-left">March 3, 2021</td>
</tr>

<tr>
<td class="text-left"><a href="https://www.coss.community/cossc/ocs-2020-breakout-avi-press-founder-and-ceo-of-scarf-63j">Open Core Summit: Fireside Chat with Joseph Jacks on OSS Analytics</a></td>
<td class="text-left">December 16, 2020</td>
</tr>

<tr>
<td class="text-left"><a href="https://about.scarf.sh/post/package-registries-and-open-source">Are Package Registries Holding Open-Source Hostage?</a></td>
<td class="text-left">November 11, 2020</td>
</tr>

<tr>
<td class="text-left"><a href="https://about.scarf.sh/post/analytics-and-open-source-sustainability">Analytics and Open Source Sustainability</a></td>
<td class="text-left">July 9, 2020</td>
</tr>

<tr>
<td class="text-left"><a href="https://github.com/aviaviavi/talks/blob/master/intro-to-parsers-2019-01/PITCHME.md">Introduction to Parsers in Haskell (slides)</a></td>
<td class="text-left">September 1, 2019</td>
</tr>

<tr>
<td class="text-left"><a href="https://podcastaddict.com/episode/https://feeds.soundcloud.com/stream/639597036-user-410091210-open-source-case-study-reality-of-getting-paid-for-free-software.mp3&amp;podcastId=3302482">Cloud2030 Podcast: Reality of Getting Paid for Free Software</a></td>
<td class="text-left">June 22, 2012</td>
</tr>

<tr>
<td class="text-left"><a href="https://medium.com/swlh/a-failed-effort-to-get-paid-for-an-open-source-project-bd7fa4658a1e">A Failed Effort to Get Paid for an Open Source Project</a></td>
<td class="text-left">May 29, 2019</td>
</tr>

<tr>
<td class="text-left"><a href="posts/2017-08-25-haskell-dbs-and-musicbrainz.html">Easy Database Access with Haskell and postgresql-simple</a></td>
<td class="text-left">August 25, 2017</td>
</tr>

<tr>
<td class="text-left"><a href="https://cocosci.princeton.edu/mike/CachingAlgorithms.pdf">Caching Algorithms and Rational Models of Memory</a></td>
<td class="text-left">May, 2014</td>
</tr>
</tbody>
</table>
</div>
</div>
</div></div></div>
</body>
</html>
